"""
Є список чисел:

lis = [1, 34, 8, 0, -5, 7, 32, 74, 59, 92, 41, 10, -2]
Знайдіть найменший елемент списку і перемістіть його в залежності від умови:

якщо знайдений елемент менший за нуль, то помістіть його в кінець списку
якщо знайдений елемент більший або дорівнює нулю, то помістіть його на початок списку.
Важливо: знаходження мінімального елемента здійсніть без використання вбудованих функцій в Python.
"""
lis = [1, 34, 8, 0, -5, 7, 32, 74, 59, 92, 41, 10, -2]
a = lis[0]

for i in lis:
    if i < a:
        a = i

lis.remove(a)

if a < 0:
    lis.append(a)
else:
    lis.insert(0, a)

print(lis)