"""
Створіть програму, в якій користувач вказуватиме розмір словника, після чого встановлюватиме ключі та значення з
клавіатури, наприклад:

# Результат виконання програми
Кількість елементів: 3
Ключ: name
Значення: John
Ключ: age
Значення: 22
Ключ: happiness
Значення: 0.98
{"name": "John", "age": "22", "happiness": "0.98"}
"""

data = {}
num_of_elements = int(input("Введіть кількість елементів: "))
for i in range(num_of_elements):
    key = input("Введіть ключ: ")
    value = input("Введіть значення: ")
    data[key] = value
print(data)