"""
Створіть функцію, яка підраховує відстань, яку проїде людина.
Функція приймає два параметри: час і швидкість.

При виведенні результату використовуйте функцію lambda для виведення коректної інформації:

виводьте рядок: "Ви проїдете: 1 кілометр", якщо результат був рівний одиниці
виводьте рядок: "Ви проїдете: цифра кілометрів", якщо результат був більшим за одиницю
"""


res = lambda t, v: t * v

t = int(input("Введіть час в дорозі: "))
v = int(input("Введіть швидкість: "))

if res(t,v) == 1:
    print(f"Ви проїдете: {res(t,v)} кілометр")
else:
    print(f"Ви проїдете: {res(t,v)} кілометрів")



